html/portfolio/ringbuf.h.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-06-10 Sat 14:16 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Ethan Smith" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div class="org-src-container">
<pre class="src src-c"><span class="linenr"> 1: </span><span style="color: #4078f2; font-weight: bold;">#if</span><span style="color: #4078f2; font-weight: bold;">n</span><span style="color: #4078f2; font-weight: bold;">def</span> <span style="color: #b751b6;">RINGBUF_H</span>
<span class="linenr"> 2: </span><span style="color: #4078f2; font-weight: bold;">#define</span> <span style="color: #6a1868;">RINGBUF_H</span>
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #4078f2; font-weight: bold;">#include</span> <span style="color: #4078f2;">&lt;</span><span style="color: #50a14f;">stdlib.h</span><span style="color: #4078f2;">&gt;</span>
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span><span style="color: #9ca0a4;">/* </span><span style="color: #9ca0a4;">Lock-Free thread messaging.</span>
<span class="linenr"> 7: </span><span style="color: #9ca0a4;"> *</span>
<span class="linenr"> 8: </span><span style="color: #9ca0a4;"> * ring-buffer has designated producers and consumers. the read-head points to</span>
<span class="linenr"> 9: </span><span style="color: #9ca0a4;"> * the location of the next insertion, and the read-head points to the location</span>
<span class="linenr">10: </span><span style="color: #9ca0a4;"> * before the next read.</span>
<span class="linenr">11: </span><span style="color: #9ca0a4;"> *</span>
<span class="linenr">12: </span><span style="color: #9ca0a4;"> * every time an element is inserted into the ringbuffer, the write_head is</span>
<span class="linenr">13: </span><span style="color: #9ca0a4;"> * incremented.</span>
<span class="linenr">14: </span><span style="color: #9ca0a4;">*</span><span style="color: #9ca0a4;">*/</span>
<span class="linenr">15: </span>
<span class="linenr">16: </span><span style="color: #e45649;">struct</span> <span style="color: #986801;">RingBuffer</span> <span style="color: #4078f2;">{</span>
<span class="linenr">17: </span>    <span style="color: #986801;">char</span>* <span style="color: #6a1868;">_buffer</span>;
<span class="linenr">18: </span>    <span style="color: #986801;">size_t</span> <span style="color: #6a1868;">length</span>;
<span class="linenr">19: </span>    <span style="color: #986801;">size_t</span> <span style="color: #6a1868;">element_size</span>;
<span class="linenr">20: </span>
<span class="linenr">21: </span>    <span style="color: #986801;">int</span> <span style="color: #6a1868;">write_head</span>;
<span class="linenr">22: </span>    <span style="color: #986801;">int</span> <span style="color: #6a1868;">read_head</span>;
<span class="linenr">23: </span><span style="color: #4078f2;">}</span>;
<span class="linenr">24: </span>
<span class="linenr">25: </span><span style="color: #9ca0a4;">/// </span><span style="color: #9ca0a4;">wrapper struct. This struct is what is passed to the producer thread.</span>
<span class="linenr">26: </span><span style="color: #9ca0a4;">/// </span><span style="color: #9ca0a4;">the ringbuffer field is not meant to be directly accessed.</span>
<span class="linenr">27: </span><span style="color: #e45649;">struct</span> <span style="color: #986801;">Producer</span> <span style="color: #4078f2;">{</span>
<span class="linenr">28: </span>    <span style="color: #e45649;">struct</span> <span style="color: #986801;">RingBuffer</span>* <span style="color: #6a1868;">_ringbuf</span>;
<span class="linenr">29: </span><span style="color: #4078f2;">}</span>;
<span class="linenr">30: </span>
<span class="linenr">31: </span><span style="color: #9ca0a4;">/// </span><span style="color: #9ca0a4;">wrapper struct. This struct is what is passed to the consumer thread.</span>
<span class="linenr">32: </span><span style="color: #9ca0a4;">/// </span><span style="color: #9ca0a4;">the ringbuffer field is not meant to be directly accessed.</span>
<span class="linenr">33: </span><span style="color: #e45649;">struct</span> <span style="color: #986801;">Consumer</span> <span style="color: #4078f2;">{</span>
<span class="linenr">34: </span>    <span style="color: #e45649;">struct</span> <span style="color: #986801;">RingBuffer</span>* <span style="color: #6a1868;">_ringbuf</span>;
<span class="linenr">35: </span><span style="color: #4078f2;">}</span>;
<span class="linenr">36: </span>
<span class="linenr">37: </span><span style="color: #e45649;">struct</span> <span style="color: #986801;">RingBuffer</span> <span style="color: #a626a4;">ringbuf_new</span><span style="color: #4078f2;">(</span><span style="color: #986801;">size_t</span> <span style="color: #6a1868;">len</span>, <span style="color: #986801;">size_t</span> <span style="color: #6a1868;">element_size</span><span style="color: #4078f2;">)</span>;
<span class="linenr">38: </span><span style="color: #986801;">void</span> <span style="color: #a626a4;">ringbuf_del</span><span style="color: #4078f2;">(</span><span style="color: #e45649;">struct</span> <span style="color: #986801;">RingBuffer</span>* <span style="color: #6a1868;">ringbuf</span><span style="color: #4078f2;">)</span>;
<span class="linenr">39: </span>
<span class="linenr">40: </span><span style="color: #986801;">int</span> <span style="color: #a626a4;">ringbuf_next_index</span><span style="color: #4078f2;">(</span><span style="color: #e45649;">const</span> <span style="color: #e45649;">struct</span> <span style="color: #986801;">RingBuffer</span>* <span style="color: #6a1868;">rb</span>, <span style="color: #986801;">int</span> <span style="color: #6a1868;">index</span><span style="color: #4078f2;">)</span>;
<span class="linenr">41: </span><span style="color: #986801;">void</span> <span style="color: #a626a4;">ringbuf_print</span><span style="color: #4078f2;">(</span><span style="color: #e45649;">struct</span> <span style="color: #986801;">RingBuffer</span>* <span style="color: #6a1868;">rb</span><span style="color: #4078f2;">)</span>;
<span class="linenr">42: </span>
<span class="linenr">43: </span><span style="color: #e45649;">struct</span> <span style="color: #986801;">Producer</span> <span style="color: #a626a4;">ringbuf_make_producer</span><span style="color: #4078f2;">(</span><span style="color: #e45649;">struct</span> <span style="color: #986801;">RingBuffer</span>* <span style="color: #6a1868;">ringbuf</span><span style="color: #4078f2;">)</span>;
<span class="linenr">44: </span>
<span class="linenr">45: </span><span style="color: #9ca0a4;">/// </span><span style="color: #9ca0a4;">pushes value into the ringbuffer returns 0 on success.</span>
<span class="linenr">46: </span><span style="color: #9ca0a4;">/// </span><span style="color: #9ca0a4;">may fail if the ring buffer is full (ie, write-head runs into read-head).</span>
<span class="linenr">47: </span><span style="color: #9ca0a4;">/// </span><span style="color: #9ca0a4;">returns -1 on fail</span>
<span class="linenr">48: </span><span style="color: #986801;">int</span> <span style="color: #a626a4;">producer_push</span><span style="color: #4078f2;">(</span><span style="color: #e45649;">struct</span> <span style="color: #986801;">Producer</span>* <span style="color: #6a1868;">producer</span>, <span style="color: #986801;">void</span>* <span style="color: #6a1868;">val</span><span style="color: #4078f2;">)</span>;
<span class="linenr">49: </span>
<span class="linenr">50: </span><span style="color: #e45649;">struct</span> <span style="color: #986801;">Consumer</span> <span style="color: #a626a4;">ringbuf_make_consumer</span><span style="color: #4078f2;">(</span><span style="color: #e45649;">struct</span> <span style="color: #986801;">RingBuffer</span>* <span style="color: #6a1868;">ringbuf</span><span style="color: #4078f2;">)</span>;
<span class="linenr">51: </span>
<span class="linenr">52: </span><span style="color: #986801;">void</span>* <span style="color: #a626a4;">consumer_pop</span><span style="color: #4078f2;">(</span><span style="color: #e45649;">struct</span> <span style="color: #986801;">Consumer</span>* <span style="color: #6a1868;">consumer</span><span style="color: #4078f2;">)</span>;
<span class="linenr">53: </span><span style="color: #986801;">void</span>* <span style="color: #a626a4;">consumer_peek</span><span style="color: #4078f2;">(</span><span style="color: #e45649;">struct</span> <span style="color: #986801;">Consumer</span>* <span style="color: #6a1868;">consumer</span><span style="color: #4078f2;">)</span>;
<span class="linenr">54: </span>
<span class="linenr">55: </span><span style="color: #4078f2; font-weight: bold;">#endif</span> <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">RINGBUF_H</span>
</pre>
</div>
</div>
</body>
</html>